In [1]:
# Kerry's Edits

In [1]:
import pandas as pd 
import numpy as np
import sqlite3
conn = sqlite3.connect('CourseDataWarehouse.db')
c = conn.cursor()

In [2]:
%load_ext sql
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [3]:
%%sql 
sqlite:///CourseData.db

'Connected: @CourseData.db'

In [4]:
%%sql
DROP TABLE IF EXISTS CALCULATIONS;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[]

In [19]:
fall = ['SourceData/Fall2014/courses.csv','SourceData/Fall2015/courses.csv', 'SourceData/Fall2016/courses.csv',
        'SourceData/Fall2017/courses.csv','SourceData/Fall2018/courses.csv']
dff0 = pd.read_csv(fall[0])
dff1 = pd.read_csv(fall[1])
dff2 = pd.read_csv(fall[2])    
dff3 = pd.read_csv(fall[3])
dff4 = pd.read_csv(fall[4])

In [28]:
dff0.describe(),dff1.describe(),dff2.describe(),dff3.describe(),dff4.describe()

(                crn          cap          act          rem
 count   1522.000000  1522.000000  1522.000000  1522.000000
 mean   71770.528252    17.001314    15.542707     2.120894
 std     1071.304592    10.599021     9.930982    26.712384
 min    70001.000000     0.000000    -1.000000   -56.000000
 25%    70713.250000    10.000000     7.000000    -1.000000
 50%    71798.000000    18.000000    16.000000     1.000000
 75%    72689.500000    25.000000    24.000000     4.000000
 max    73514.000000    80.000000    72.000000   999.000000,
                 crn          cap          act          rem
 count   1475.000000  1475.000000  1475.000000  1475.000000
 mean   76006.920000    17.927458    16.239322     1.688136
 std      670.431394    10.355199     9.814719     7.803495
 min    75001.000000     0.000000     0.000000   -59.000000
 25%    75417.500000    12.000000     8.000000     0.000000
 50%    75869.000000    18.000000    16.000000     1.000000
 75%    76711.500000    25.000000    24.000000     5.000000
 max    77273.000000    83.000000    80.000000    42.000000,
                 crn          cap          act          rem
 count   1491.000000  1491.000000  1491.000000  1491.000000
 mean   77997.181757    18.796781    16.223340     2.573441
 std      668.822390    16.601112     9.993643    15.217720
 min    77001.000000     0.000000     0.000000   -75.000000
 25%    77406.500000    12.000000     8.000000     0.000000
 50%    77860.000000    19.000000    16.000000     1.000000
 75%    78601.000000    25.000000    24.000000     5.000000
 max    79215.000000   500.000000    87.000000   500.000000,
                 crn          cap          act          rem
 count   1479.000000  1479.000000  1479.000000  1479.000000
 mean   71929.437458    19.315078    16.705206     2.609872
 std      621.643272    16.476234     9.816568    15.230966
 min    71001.000000     0.000000     0.000000   -72.000000
 25%    71397.500000    15.000000     9.000000     0.000000
 50%    71795.000000    20.000000    17.000000     1.000000
 75%    72457.500000    25.000000    24.000000     5.000000
 max    73094.000000   500.000000    90.000000   500.000000,
                 crn          cap          act          rem
 count   1519.000000  1519.000000  1519.000000  1519.000000
 mean   74958.886768    18.954575    16.849901     2.104674
 std      625.457619    16.414667     9.718765    15.059573
 min    74001.000000     0.000000     0.000000   -60.000000
 25%    74419.500000    12.000000     9.000000     0.000000
 50%    74871.000000    20.000000    18.000000     1.000000
 75%    75613.000000    25.000000    24.000000     4.000000
 max    76057.000000   500.000000    65.000000   500.000000)

In [20]:
df_fall = pd.concat([dff0, dff1, dff2, dff3, dff4])
df_fall.head()

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Fall2014,70384,AC 0011,C01,3.000,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '0800am-0915am', 'dat...",['TF 0800am-0915am 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31
1,Fall2014,70385,AC 0011,C02,3.000,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '0930am-1045am', 'dat...",['TF 0930am-1045am 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31
2,Fall2014,70382,AC 0011,C03,3.000,Introduction to Financial Accounting,"[{'days': 'TF', 'times': '1230pm-0145pm', 'dat...",['TF 1230pm-0145pm 09/02-12/08 DSB 105'],Michael P. Coyne,0,31,-31
3,Fall2014,70291,AC 0011,C04,3.000,Introduction to Financial Accounting,"[{'days': 'MR', 'times': '1100am-1215pm', 'dat...",['MR 1100am-1215pm 09/02-12/08 DSB 111'],Rebecca I. Bloch,0,29,-29
4,Fall2014,70350,AC 0011,C05,3.000,Introduction to Financial Accounting,"[{'days': 'MR', 'times': '1230pm-0145pm', 'dat...",['MR 1230pm-0145pm 09/02-12/08 DSB 111'],Rebecca I. Bloch,0,30,-30

In [21]:
df_fall.describe()

                crn         cap          act          rem
count   7486.000000  7486.00000  7486.000000  7486.000000
mean   74523.769169    18.39487    16.310446     2.219076
std     2512.545835    14.41373     9.863494    17.175757
min    70001.000000     0.00000    -1.000000   -75.000000
25%    72213.000000    12.00000     8.000000     0.000000
50%    74848.500000    19.00000    16.000000     1.000000
75%    76698.750000    25.00000    24.000000     5.000000
max    79215.000000   500.00000    90.000000   999.000000

In [24]:
spring = ['SourceData/Spring2015/courses.csv','SourceData/Spring2016/courses.csv', 'SourceData/Spring2017/courses.csv',
        'SourceData/Spring2018/courses.csv','SourceData/Spring2019/courses.csv', 'SourceData/SpringBreak2017/courses.csv']
dfs0 = pd.read_csv(spring[0])
dfs1 = pd.read_csv(spring[1])
dfs2 = pd.read_csv(spring[2])    
dfs3 = pd.read_csv(spring[3])
dfs4 = pd.read_csv(spring[4])
dfs5 = pd.read_csv(spring[5])

In [25]:
df_spring = pd.concat([dfs0,dfs1,dfs2,dfs3,dfs4,dfs5])
df_spring.head()

,term,crn,catalog_id,section,credits,title,meetings,timecodes,primary_instructor,cap,act,rem
0,Spring2015,32436,AC 0011,A,3.000,Introduction to Financial Accounting,"[{'days': 'MR', 'times': '0200pm-0315pm', 'dat...",['MR 0200pm-0315pm 01/20-04/30 DSB 108'],Dawn W Massey,28,28,0
1,Spring2015,33880,AC 0011,B,3.000,Introduction to Financial Accounting,"[{'days': 'MR', 'times': '0930am-1045am', 'dat...",['MR 0930am-1045am 01/20-04/30 DSB 106'],Dawn W Massey,24,26,-2
2,Spring2015,33012,AC 0012,A,3.000,Introduction to Management Accounting,"[{'days': 'MR', 'times': '1100am-1215pm', 'dat...",['MR 1100am-1215pm 01/20-04/30 DSB 110A'],Rebecca I. Bloch,28,30,-2
3,Spring2015,33013,AC 0012,B,3.000,Introduction to Management Accounting,"[{'days': 'MR', 'times': '1230pm-0145pm', 'dat...",['MR 1230pm-0145pm 01/20-04/30 DSB 104'],Rebecca I. Bloch,28,28,0
4,Spring2015,33014,AC 0012,C,3.000,Introduction to Management Accounting,"[{'days': 'MR', 'times': '0330pm-0445pm', 'dat...",['MR 0330pm-0445pm 01/20-04/30 DSB 104'],Rebecca I. Bloch,28,28,0

In [26]:
df_spring.describe()

                crn          cap          act          rem
count   7122.000000  7122.000000  7122.000000  7122.000000
mean   35212.001966    18.123982    15.658804     2.465178
std     2618.670948    10.876640    10.342885     6.497100
min    31001.000000     0.000000     0.000000   -47.000000
25%    32773.250000    11.000000     7.000000     0.000000
50%    34835.000000    19.000000    16.000000     1.000000
75%    37693.750000    25.000000    24.000000     4.000000
max    41702.000000   100.000000    90.000000    89.000000

In [11]:
avgcap = df1['cap'].mean

In [12]:
print(avgcap, 30)

<bound method Series.mean of 0        0
1        0
2        0
3        0
4        0
5        0
6       30
7       30
8       30
9       30
10      30
11      30
12      30
13      30
14      30
15      30
16      28
17      28
18      17
19      24
20      10
21      10
22      24
23      10
24      10
25      28
26      25
27      25
28      10
29      10
        ..
1492    19
1493    19
1494     0
1495     0
1496    18
1497     2
1498     0
1499     4
1500    18
1501    18
1502    18
1503    18
1504    25
1505    14
1506    14
1507     8
1508    12
1509    18
1510     0
1511     0
1512    14
1513    16
1514    12
1515     8
1516    15
1517     0
1518     0
1519     0
1520     1
1521     0
Name: cap, Length: 1522, dtype: int64> 30

In [5]:
%%sql
CREATE TABLE 'CALCULATIONS'(
    AvgCap INTERGER,
    SumHours INTEGER
);

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[]

In [6]:
%%sql
SELECT *
FROM CALCULATIONS
;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[]

In [7]:
%%sql
INSERT INTO CALCULATIONS (AvgCap)
SELECT Cap
FROM SECTION

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
17435 rows affected.

[]

In [13]:
%%sql 
SELECT *
FROM CALCULATIONS 
WHERE AvgCap <> 'cap'
ORDER BY AvgCap DESC
LIMIT 30;

 * sqlite:///CourseData.db
   sqlite:///CourseDataWarehouse.db
Done.

[(500, None),
 (500, None),
 (500, None),
 (500, None),
 (100, None),
 (100, None),
 (100, None),
 (100, None),
 (100, None),
 (93, None),
 (93, None),
 (92, None),
 (92, None),
 (92, None),
 (92, None),
 (91, None),
 (90, None),
 (90, None),
 (88, None),
 (88, None),
 (86, None),
 (86, None),
 (86, None),
 (85, None),
 (83, None),
 (80, None),
 (80, None),
 (80, None),
 (80, None),
 (80, None)]